Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAA169.PIC
      <edc:DCRDef edc:_addr="0x1FC4FFF4" edc:access="--------------------------------" edc:cname="BF1SEQ2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFF8" edc:access="--------------------------------" edc:cname="BF1SEQ1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC4FFFC" edc:access="--------------------------------" edc:cname="BF1SEQ0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="BF1SEQ0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc6ff30" edc:endaddr="0x1fc6ff80" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="altboot2config" edc:regionidref="lowerbootaliasconfig" edc:registerprefix="ABF2">
      <edc:AdjustPoint edc:_addr="0x1FC6FF30" edc:offset="0xc"/>
      <edc:DCRDef edc:_addr="0x1FC6FF3C" edc:access="---nnnnn------------------------" edc:cname="ABF2DEVCFG4" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x1f000000" edc:name="ABF2DEVCFG4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:DCRFieldDef edc:cname="SWDTPS" edc:desc="Sleep Mode Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="SPS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SPS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SPS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SPS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SPS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SPS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SPS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="SPS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SPS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="SPS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="SPS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="SPS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="SPS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="SPS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="SPS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="SPS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="SPS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="SPS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="SPS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="SPS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="SPS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF40" edc:access="--nnn-nn--------nnnnnnnnnnnnnnnn" edc:cname="ABF2DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x3b00ffff" edc:name="ABF2DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffff0000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FETHIO" edc:desc="Ethernet I/O Pin Select" edc:mask="0x1" edc:name="FETHIO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Alternate Ethernet I/O" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Default Ethernet I/O" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PGL1WAY" edc:desc="Permission Group Lock One Way Configuration" edc:mask="0x1" edc:name="PGL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
