Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAA169.PIC
      <edc:SFRDef edc:_addr="0x1F882230" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="EMAC1IPGR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx0001100x0010010" edc:name="EMAC1IPGR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx0001100x0010010" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxIPGR"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NB2BIPKTGP2" edc:desc="" edc:mask="0x7f" edc:name="NB2BIPKTGP2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="NB2BIPKTGP1" edc:desc="" edc:mask="0x7f" edc:name="NB2BIPKTGP1" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882240" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="------------------nnnnnn----nnnn" edc:cname="EMAC1CLRT" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxx110111xxxx1111" edc:name="EMAC1CLRT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxx110111xxxx1111" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxCLRT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RETX" edc:desc="" edc:mask="0xf" edc:name="RETX" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CWINDOW" edc:desc="" edc:mask="0x1" edc:name="CWINDOW" edc:nzwidth="0x6"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882250" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MAXF" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000010111101110" edc:name="EMAC1MAXF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000010111101110" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMAXF"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MACMAXF" edc:desc="" edc:mask="0x1" edc:name="MACMAXF" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882260" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="--------------------n--n--------" edc:cname="EMAC1SUPP" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0xx10xx000000x00" edc:name="EMAC1SUPP" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0xx10xx000000x00" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxSUPP"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SPEEDRMII" edc:desc="" edc:mask="0x1" edc:name="SPEEDRMII" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RESETRMII" edc:desc="" edc:mask="0x1" edc:name="RESETRMII" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882270" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="-----------------------------nnn" edc:cname="EMAC1TEST" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxx000" edc:name="EMAC1TEST" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxx000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxTEST"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SHRTQNTA" edc:desc="" edc:mask="0x1" edc:name="SHRTQNTA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TESTPAUSE" edc:desc="" edc:mask="0x1" edc:name="TESTPAUSE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TESTBP" edc:desc="" edc:mask="0x1" edc:name="TESTBP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882280" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------n---------nnnnnn" edc:cname="EMAC1MCFG" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0xxxxxxxxx100000" edc:name="EMAC1MCFG" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0xxxxxxxxx100000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMCFG"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCANINC" edc:desc="" edc:mask="0x1" edc:name="SCANINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOPRE" edc:desc="" edc:mask="0x1" edc:name="NOPRE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x1" edc:name="CLKSEL" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RESETMGMT" edc:desc="" edc:mask="0x1" edc:name="RESETMGMT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882290" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="------------------------------nn" edc:cname="EMAC1MCMD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:name="EMAC1MCMD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMCMD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="READ" edc:desc="" edc:mask="0x1" edc:name="READ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCAN" edc:desc="" edc:mask="0x1" edc:name="SCAN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
